// Задача 42: Напишите программу, которая будет преобразовывать десятичное число в двоичное.
// 45 -> 101101
// 3 -> 11
// 2 -> 10

Console.Write("Введите число: ");
int n = Convert.ToInt32(Console.ReadLine());
int  = 0; //количество цифр в числе

for ()
